In [2]:
import pandas as pd
import numpy as np
from numpy import nan as NA

In [3]:
string_data = pd.Series(['aa','bb',np.nan,'vv'])

In [4]:
data = pd.Series([1,NA,3.5,NA,7])
data1 = pd.DataFrame([[1,2,3],[NA,NA,NA],[NA,3,4]])

In [5]:
data1.dropna(how='all')

     0    1    2
0  1.0  2.0  3.0
2  NaN  3.0  4.0

In [33]:
df = pd.DataFrame( np.random.randn(7,3))
df.iloc[:4,1] = NA
df.iloc[:2,2] = NA
df

          0         1         2
0 -1.622921       NaN       NaN
1 -1.079921       NaN       NaN
2  0.644539       NaN -0.249715
3  0.968485       NaN  1.531436
4 -1.604776 -0.484357 -1.903740
5  3.296674  0.248377  0.544038
6 -0.061808  0.728917  2.030443

In [45]:
df.fillna({1:1,2: 3,3:4})

          0         1         2
0 -1.622921  1.000000  3.000000
1 -1.079921  1.000000  3.000000
2  0.644539  1.000000 -0.249715
3  0.968485  1.000000  1.531436
4 -1.604776 -0.484357 -1.903740
5  3.296674  0.248377  0.544038
6 -0.061808  0.728917  2.030443

In [50]:
df.fillna(method='bfill', limit=1)

          0         1         2
0 -1.622921       NaN       NaN
1 -1.079921       NaN -0.249715
2  0.644539       NaN -0.249715
3  0.968485 -0.484357  1.531436
4 -1.604776 -0.484357 -1.903740
5  3.296674  0.248377  0.544038
6 -0.061808  0.728917  2.030443

In [58]:
data = pd.DataFrame({'k1':['one','two']*3 + ['two','two'],
'k2':[1,1,2,3,3,4,4,4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4
7  two   4

In [59]:
data.duplicated()
data.drop_duplicates(keep = 'last')

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
7  two   4

In [60]:
data = pd.DataFrame({'name':['Kien','huyen','mo'],
'tuoi':[32,32,2]
})

In [61]:
gender_of_people = {
    'kien':'male',
    'huyen':'female',
    'mo':'female'
}

In [62]:
data['animal'] = data['name'].str.lower().map(gender_of_people)
data

    name  tuoi  animal
0   kien    32    male
1  huyen    32  female
2     Mo     2  female

In [63]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
index=['Ohio', 'Colorado', 'New York'],
columns=['one', 'two', 'three', 'four'])

In [64]:
data.index.map(lambda x: x[:4].upper())

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [65]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [ ]:
#lala